; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph2 - mode
	thermograph5 - mode
	infrared3 - mode
	infrared0 - mode
	thermograph1 - mode
	infrared7 - mode
	spectrograph4 - mode
	thermograph6 - mode
	GroundStation5 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph6)
	(supports instrument1 infrared7)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument3 infrared3)
	(supports instrument3 infrared7)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite2 GroundStation0)
	(have_image Phenomenon7 thermograph6)
	(have_image Star8 infrared7)
	(have_image Star8 thermograph5)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon9 infrared3)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 thermograph6)
	(have_image Planet11 infrared7)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 phenomenon10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon10)
   goals met: 0 of 10
5. (turn_to satellite1 groundstation0 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 10
6. (turn_to satellite0 groundstation4 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 10
7. (take_image satellite2 phenomenon10 instrument3 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 1 of 10
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 10
10. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 10
11. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 10
12. (turn_to satellite0 phenomenon7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 10
13. (take_image satellite0 phenomenon7 instrument1 thermograph6)
   added: (have_image phenomenon7 thermograph6)
   goals met: 2 of 10
14. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 10
15. (take_image satellite0 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 3 of 10
16. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 3 of 10
17. (take_image satellite0 planet11 instrument1 infrared7)
   added: (have_image planet11 infrared7)
   goals met: 4 of 10
18. (take_image satellite0 planet11 instrument1 thermograph6)
   added: (have_image planet11 thermograph6)
   goals met: 5 of 10
19. (turn_to satellite1 phenomenon10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 10
20. (take_image satellite1 phenomenon10 instrument2 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 10
21. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 10
22. (take_image satellite1 phenomenon9 instrument2 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 7 of 10
23. (turn_to satellite2 star8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star8)
   goals met: 7 of 10
24. (take_image satellite2 star8 instrument3 infrared7)
   added: (have_image star8 infrared7)
   goals met: 8 of 10
25. (take_image satellite2 star8 instrument3 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 9 of 10
26. (turn_to satellite2 groundstation0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation0)
   goals met: 10 of 10
